'use strict';

angular.module('myApp.home', ['ngRoute'])

    .config(['$routeProvider', function ($routeProvider) {
        $routeProvider.when('/home', {
            templateUrl: 'home/home.html',
            controller: 'HomeCtrl'
        });
    }])

    .controller('HomeCtrl', function ($scope) {
        $scope.gallery = {name: 'OnArt',
            info: '"OnArt" е онлайн арт галерия предоставяща бърз и удобен начин за публикуване и закупуване на картини на български художници. Идеята на онлайн арт галерия "OnArt" е създаването на арт портал предлагащ голямо разнообразие от високостойностни произведения на изкуството, чийто автори са доказани или тепърва изгряващи български художници. Потребителите на "OnArt" имат възможност за търсене на картини по категория, автор, клучова дума и ценови интервал. Резултатите от търсене се подреждат по дата или цена така потребителя може максимално бързо да се съсредоточи върху картините, които представляват интерес за него. Всеки български художник имащ желание да представи творбите си в "OnArt" може да заяви това като попълни формата за регистрация тук. До 10 дена регистрацията ще бъде прегледана и ще получите и-мейл дали е одобрена.',
            visitors: '8932',
            thumbnail: '/app/img/gallery.jpg'};
    });